# Вычислить число ПИ c заданной точностью d

import math
d = int(input('Введите точность числа ПИ: '))
print (round(math.pi, d))

